from datetime import timedelta

#TODO: mine_names - > mines
mine_names = ['Глиняный карьер', 'Лесопилка', 'Железный рудник', 'Ферма']

hero_unit = {
    # name:  0       1           2        3     4     5      6     7     8       9        10
    # name: атака, защита пех, защита кон, дерево, глина, камень, зерно, кроп, скорость, перенос, время постройки
    'герой': (0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
}

rome_units = {
    # name:  0       1           2        3     4     5      6     7     8       9        10
    # name: атака, защита пех, защита кон, дерево, глина, камень, зерно, кроп, скорость, перенос, время постройки
    'легионер': (40, 35, 50, 120, 100, 150, 30, 1, 6, 50, timedelta(minutes=26, seconds=40)),
	'преторианец': (30, 65, 35, 100, 130, 160, 70, 1, 5, 20, timedelta(minutes=29, seconds=20)),
	'империанец': (70, 40, 25, 150, 160, 210, 80, 1, 7, 50, timedelta(minutes=32)),
	'конный разведчик': (0, 20, 10, 140, 160, 20, 40, 2, 16, 0, timedelta(minutes=22, seconds=40)),
	'конница императора':	(120, 65, 50, 550, 440, 320, 100, 3, 14, 100, timedelta(minutes=44)),
	'конница Цезаря': (180, 80, 105, 550, 640, 800, 180, 4, 10, 70, timedelta(minutes=58, seconds=40)),
	'таран': (60, 30, 75, 900, 360, 500, 70, 3, 4, 0, timedelta(hours=1, minutes=16, seconds=40)),
	'огненная катапульта': (75, 60, 10, 950, 1350, 600, 90, 6, 3, 0, timedelta(hours=2, minutes=30)),
	'сенатор': (50, 40, 30, 30750, 27200, 45000, 37500, 5, 4, 0, timedelta(hours=25, minutes=11, seconds=40)),
	'поселенец': (0, 80, 80, 4600, 4200, 5800, 4400, 1, 5, 3000, timedelta(hours=7, minutes=28, seconds=20)),
}


german_units = {
    # name:  0       1           2        3     4     5      6     7     8       9        10
    # name: атака, защита пех, защита кон, дерево, глина, камень, зерно, кроп, скорость, перенос, время постройки
	'дубинщик': (40, 20, 5, 95, 75, 40, 40, 1, 7, 60, timedelta(minutes=12)),
	'копьеносец': (10, 35, 60, 145, 70, 85, 40, 1, 7, 40, timedelta(minutes=18, seconds=40)),
	'топорщик': (60, 30, 30, 130, 120, 170, 70, 1, 6, 50, timedelta(minutes=20)),
	'скаут': (0, 10, 5, 160, 100, 50, 50, 1, 9, 0, timedelta(minutes=18, seconds=40)),
	'паладин': (55, 100, 40, 370, 270, 290, 75, 2, 10, 110, timedelta(minutes=40)),
	'тевтонская конница': (150, 50, 75, 450, 515, 480, 80, 3, 9, 80, timedelta(minutes=49, seconds=20)),
	'стенобитное орудие': (65, 30, 80, 1000, 300, 350, 70, 3, 4, 0, timedelta(hours=1, minutes=10)),
	'катапульта': (50, 60, 10, 900, 1200, 600, 60, 6, 3, 0, timedelta(hours=2, minutes=30)),
	'вождь': (40, 60, 40, 35500, 26600, 25000, 27200, 4, 4, 0, timedelta(hours=19, minutes=35)),
	'поселенец': (10, 80, 80, 5800, 4400, 4600, 5200, 1, 5, 3000, timedelta(hours=8, minutes=36, seconds=40)),
}


gaul_units = {
    # name:  0       1           2        3     4     5      6     7     8       9        10
    # name: атака, защита пех, защита кон, дерево, глина, камень, зерно, кроп, скорость, перенос, время постройки
	'фаланга': (15, 40, 50, 100, 130, 55, 30, 1, 7, 35, timedelta(minutes=17, seconds=20)),
	'мечник': (65, 35, 20, 140, 150, 185, 60, 1, 6, 45, timedelta(minutes=24)),
	'следопыт': (0, 20, 10, 170, 150, 20, 40, 2, 17, 0, timedelta(minutes=22, seconds=40)),
	'тевтатский гром': (90, 25, 40, 350, 450, 230, 60, 2, 19, 75, timedelta(minutes=41, seconds=20)),
	'друид-всадник': (45, 115, 55, 360, 330, 280, 120, 2, 16, 35, timedelta(minutes=42, seconds=40)),
	'эдуйская конница': (140, 60, 165, 500, 620, 675, 170, 3, 13, 65, timedelta(minutes=52)),
	'таран': (50, 30, 105, 950, 555, 330, 75, 3, 4, 0, timedelta(hours=1, minutes=23, seconds=20)),
	'требучет': (70, 45, 10, 960, 1450, 630, 90, 6, 3, 0, timedelta(hours=2, minutes=30)),
	'предводитель': (40, 50, 50, 30750, 45400, 31000, 37500, 4, 5, 0, timedelta(hours=25, minutes=11, seconds=40)),
	'поселенец': (0, 80, 80, 4400, 5600, 4200, 3900, 1, 5, 3000, timedelta(hours=6, minutes=18, seconds=20)),

}


nature_units = {
    # name:  0       1           2        3     4     5      6     7     8       9        10
    # name: атака, защита пех, защита кон, дерево, глина, камень, зерно, кроп, скорость, перенос, время постройки
	'крыса': (10, 25, 20, 0, 0, 0, 100, 1, 20, 0, 0),
	'паук': (20, 35, 40, 0, 0, 0, 0, 1, 20, 0, 0),
	'змея': (60, 40, 60, 0, 0, 0, 0, 1, 20, 0, 0),
	'летучая мышь': (80, 66, 50, 0, 0, 0, 0, 1, 20, 0, 0),
	'кабан': (50, 70, 33, 0, 0, 0, 0, 2, 20, 0, 0),
	'волк': (100, 80, 70, 0, 0, 0, 0, 2, 20, 0, 0),
	'медвед': (250, 140, 200, 0, 0, 0, 0, 3, 20, 0, 0),
	'крокодил': (450, 380, 240, 0, 0, 0, 0, 3, 20, 0, 0),
	'тигр': (200, 170, 250, 0, 0, 0, 0, 3, 20, 0, 0),
	'слон': (600, 440, 520, 0, 0, 0, 0, 5, 20, 0, 0),
}


natar_units = {
    # name:  0       1           2        3     4     5      6     7     8       9        10
    # name: атака, защита пех, защита кон, дерево, глина, камень, зерно, кроп, скорость, перенос, время постройки
	'пикейщик': (20, 35, 50, 0, 0, 0, 0, 1, 6, 0, 0),
	'воин с шипами': (65, 30, 10, 0, 0, 0, 0, 1, 7, 0, 0),
	'стражник': (100, 90, 75, 0, 0, 0, 0, 1, 6, 0, 0),
	'хищная птица': (0, 10, 0, 0, 0, 0, 0, 1, 25, 0, 0),
	'всадник с топором': (155, 80, 50, 0, 0, 0, 0, 2, 14, 0, 0),
	'рыцарь Натаров': (170, 140, 80, 0, 0, 0, 0, 3, 12, 0, 0),
	'боевой слон': (250, 120, 150, 0, 0, 0, 0, 4, 5, 0, 0),
	'баллиста': (60, 45, 10, 0, 0, 0, 0, 5, 3, 0, 0),
    # Вообще это император натаров, но это конфликтует с империанцем
	'батя Натаров': (80, 50, 50, 0, 0, 0, 0, 1, 5, 0, 0),
	'поселенец': (30, 40, 40, 0, 0, 0, 0, 1, 5, 0, 0),
}

units = {}
units.update(hero_unit)
units.update(rome_units)
units.update(german_units)
units.update(gaul_units)
units.update(nature_units)
units.update(natar_units)




# Уровень 	Lumber 	Clay 	Iron 	Crop 	Consumption 	Construction time 	ЕК 	Производство
mines = {
    'Глиняный карьер': {
        1: (80, 40, 80, 50, 2, timedelta(minutes=3, seconds=40), 1, 7),
        2: (135, 65, 135, 85, 1, timedelta(minutes=9, seconds=10), 1, 13),
        3: (225, 110, 225, 140, 1, timedelta(minutes=18), 2, 21),
        4: (375, 185, 375, 235, 1, timedelta(minutes=32, seconds=10), 2, 31),
        5: (620, 310, 620, 390, 1, timedelta(minutes=54, seconds=50), 2, 46),
        6: (1040, 520, 1040, 650, 2, timedelta(hours=1, minutes=31, seconds=10), 3, 70),
        7: (1735, 870, 1735, 1085, 2, timedelta(hours=2, minutes=29, seconds=10), 4, 98),
        8: (2900, 1450, 2900, 1810, 2, timedelta(hours=4, minutes=2), 4, 140),
        9: (4840, 2420, 4840, 3025, 2, timedelta(hours=6, minutes=30, seconds=30), 5, 203),
        10: (8080, 4040, 8080, 5050, 2, timedelta(hours=10, minutes=28, seconds=10), 6, 280),
        11: (13500, 6750, 13500, 8435, 2, timedelta(hours=10, minutes=28, seconds=10), 7, 392),
        12: (22540, 11270, 22540, 14090, 2, timedelta(hours=16, minutes=48, seconds=30), 9, 525),
        13: (37645, 18820, 37645, 23525, 2, timedelta(hours=26, minutes=56, seconds=50), 11, 693),
        14: (62865, 31430, 62865, 39290, 2, timedelta(hours=43, minutes=10, seconds=20), 13, 889),
        15: (104985, 52490, 104985, 65615, 2, timedelta(hours=69, minutes=7, seconds=50), 15, 1120),
        16: (175320, 87660, 175320, 109575, 3, timedelta(hours=110, minutes=39, seconds=50), 18, 1400),
        17: (292790, 146395, 292790, 182995, 3, timedelta(hours=117, minutes=7, seconds=0), 22, 1820),
        18: (488955, 244480, 488955, 305600, 3, timedelta(hours=283, minutes=26, seconds=30), 27, 2240),
        19: (816555, 408280, 816555, 510350, 3, timedelta(hours=453, minutes=33, seconds=40), 32, 2800),
        20: (1363650, 681825, 1363650, 852280, 3, timedelta(hours=725, minutes=45, seconds=10), 38, 3430),
    },
    'Лесопилка': {
        1: (40, 100, 50, 60, 2, timedelta(minutes=4, seconds=32), 1, 7),
        2: (65, 165, 85, 100, 1, timedelta(minutes=10, seconds=20), 1, 13),
        3: (110, 280, 140, 165, 1, timedelta(minutes=19, seconds=50), 2, 21),
        4: (185, 465, 235, 280, 1, timedelta(minutes=35), 2, 31),
        5: (310, 780, 390, 465, 1, timedelta(minutes=59, seconds=20), 2, 46),
        6: (520, 1300, 650, 780, 2, timedelta(hours=1, minutes=38, seconds=19), 3, 70),
        7: (870, 2170, 1085, 1300, 2, timedelta(hours=2, minutes=40, seconds=20), 4, 98),
        8: (1450, 3625, 1810, 2175, 2, timedelta(hours=4, minutes=19, seconds=50), 4, 140),
        9: (2420, 6050, 3025, 3630, 2, timedelta(hours=6, minutes=59, seconds=10), 5, 203),
        10: (4040, 10105, 5050, 6060, 2, timedelta(hours=11, minutes=14), 6, 280),
        11: (6750, 16870, 8435, 10125, 2, timedelta(hours=18, minutes=1, seconds=40), 7, 392),
        12: (11270, 28175, 14090, 16905, 2, timedelta(hours=28, minutes=54, seconds=10), 9, 525),
        13: (18820, 47055, 23525, 28230, 2, timedelta(hours=46, minutes=18), 11, 693),
        14: (31430, 78580, 39290, 47150, 2, timedelta(hours=74, minutes=8), 13, 889),
        15: (52490, 131230, 65615, 78740, 2, timedelta(hours=118, minutes=40, seconds=10), 15, 1120),
        16: (87660, 219155, 109575, 131490, 3, timedelta(hours=189, minutes=55, seconds=30), 18, 1400),
        17: (146395, 365985, 182995, 219590, 3, timedelta(hours=303, minutes=56, seconds=10), 22, 1820),
        18: (244480, 611195, 305600, 366715, 3, timedelta(hours=486, minutes=21, seconds=20), 27, 2240),
        19: (408280, 1020695, 510350, 612420, 3, timedelta(hours=778, minutes=13, seconds=20), 32, 2800),
        20: (681825, 1704565, 852280, 1022740, 3, timedelta(hours=1255, minutes=12, seconds=50), 38, 3430),
    },

}






